### pandas .str property is better than using apply() method for string functions

In [1]:
import pandas as pd

In [2]:
# dictionary data

data = {
    'Year': [2091, 2092, 2093, 2094, 2095],
    'Time': [11.49, 08.61, 11.49, 09.64, 13.65],
    'Athlete': ['Shelly-Ann Fraser-Pryce', 'Elaine Thompson-Herah', 'Florence Griffith-Joyner', 'Carmelita Jeter', 'Marion Jones'],
    'Place': ['Jamaica', 'Jamaica', 'United States', 'United States', 'United States']
}

In [3]:
# Creating the dataframe using dictionary data

df = pd.DataFrame(data)

In [4]:
df

   Year   Time                   Athlete          Place
0  2091  11.49   Shelly-Ann Fraser-Pryce        Jamaica
1  2092   8.61     Elaine Thompson-Herah        Jamaica
2  2093  11.49  Florence Griffith-Joyner  United States
3  2094   9.64           Carmelita Jeter  United States
4  2095  13.65              Marion Jones  United States

### `Good way`: using pandas string property (i.e `.str` )

### u can apply any string method

### like, `str.strip(), str.replace(), str.lower(), str.upper()`

In [5]:
df['Place_uppercase'] = df['Place'].str.upper()

In [6]:
df

   Year   Time                   Athlete          Place Place_uppercase
0  2091  11.49   Shelly-Ann Fraser-Pryce        Jamaica         JAMAICA
1  2092   8.61     Elaine Thompson-Herah        Jamaica         JAMAICA
2  2093  11.49  Florence Griffith-Joyner  United States   UNITED STATES
3  2094   9.64           Carmelita Jeter  United States   UNITED STATES
4  2095  13.65              Marion Jones  United States   UNITED STATES

### `Alternative way `: using string methos inside `apply()` method

In [7]:
df['Athlete_uppercase'] = df['Athlete'].apply(lambda x: str(x).upper())

In [8]:
df

,Year,Time,Athlete,Place,Place_uppercase,Athlete_uppercase
0,2091,11.49,Shelly-Ann Fraser-Pryce,Jamaica,JAMAICA,SHELLY-ANN FRASER-PRYCE
1,2092,8.61,Elaine Thompson-Herah,Jamaica,JAMAICA,ELAINE THOMPSON-HERAH
2,2093,11.49,Florence Griffith-Joyner,United States,UNITED STATES,FLORENCE GRIFFITH-JOYNER
3,2094,9.64,Carmelita Jeter,United States,UNITED STATES,CARMELITA JETER
4,2095,13.65,Marion Jones,United States,UNITED STATES,MARION JONES